run/topoGrid/synthTopo/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    top
    {
        type               pressureInletOutletVelocity;
        phi                phi.gas;
        value              $internalField;
    }

    atm
    {
        type               pressureInletOutletVelocity;
        phi                phi.gas;
        value              $internalField;
    }

    terrain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    crater
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
