run/topoGrid/synthTopo/0/T.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    atm
    {
        type            inletOutlet;
        phi             phi.particles;
        inletValue      uniform 300;
        value           uniform 300;
    }
    top
    {
        type            inletOutlet;
        phi             phi.particles;
        inletValue      uniform 300;
        value           uniform 300;
    }
    terrain
    {
        type            zeroGradient;
    }
    crater
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
