run/topoGrid/synthTopo/0/alpha.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10.0                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1e-10;

boundaryField
{
    atm
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 1e-10;
        value           uniform 1e-10;
    }
    terrain
    {
        type            zeroGradient;
    }
    crater
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
