run/topoGrid/synthTopo/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -3 0 0 0 0 0];

internalField       uniform 0.0;

boundaryField
{
    terrain
    {
        type               calculated;
        value              $internalField;   
    }
    top
    {
        type               calculated;
        value              $internalField;   
    }
    atm
    {
        type               calculated;
        value              $internalField;   
    }
    crater
    {
        type            zeroGradient;
    }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
